[
  {
    "id": 1,
    "category": "Basics",
    "path": "basics",
    "items": [
      {
        "title": "What is React?",
        "path": "what-is-react",
        "definition": "React is an extremely popular declarative, component-based, state-driven javascript library for building user interfaces. It's goal is to make syncing data and UI easier.",
        "examples": [],
        "docs": "https://react.dev/",
        "completed": false
      },
      {
        "title": "Project Setup",
        "path": "project-setup",
        "definition": "The most popular way of setting up a react project is by using 'create-react-app'. create-react-app is a complete starter kit for react applications. Simply run 'npx create-react-app project-name' the command prompt (alt. terminal on MacOS). Any app created this way automatically comes with a development server, a webpack for module bundling and important developer tools like ESLint, Prettier, and Jest.",
        "examples": [],
        "docs": "https://react.dev/learn/start-a-new-react-project",
        "completed": false
      },
      {
        "title": "Components",
        "path": "components",
        "definition": "Components are regular JavaScript functions that describe a piece of the UI by returning JSX. It can be thought of as a “blueprint” or a “template”. Following React's separation of concerns, every Component includes its own state, logic and appearance.",
        "examples": [],
        "docs": "https://react.dev/reference/react/Component",
        "completed": false
      },
      {
        "title": "Instances",
        "path": "instances",
        "definition": "Instances are created when we use components. For example, when we have a specific component reused 4 times, there are 4 instances of this one component. They can be thought of as a physical manifestation of the component living in our component tree. Instances hold their own state and props.",
        "examples": [],
        "docs": "",
        "completed": false
      },
      {
        "title": "Elements",
        "path": "elements",
        "definition": "Elements are the result of using a component in our code. It's an immutable JavaScript object that React keeps in memory. It's HTML that will eventually be inserted into the DOM and become a DOM element.",
        "examples": [],
        "docs": "",
        "completed": false
      },
      {
        "title": "State",
        "path": "state",
        "definition": "State is a fundamental concept in React. It's an object that holds data or information about the component. It allows the component to remember and manage dynamic values that can change over time, like user input, fetched data, or just UI interactions. When the state of a component changes, React automatically re-renders the component and all of it's children and updates the UI to reflect the new state.",
        "examples": [],
        "docs": "https://legacy.reactjs.org/docs/state-and-lifecycle.html",
        "completed": false
      }
    ]
  },
  {
    "id": 2,
    "category": "State Management",
    "path": "state-management",
    "items": [
      {
        "title": "useState",
        "path": "usestate",
        "definition": "useState is a state management hook in React. It allows you to create a state variable, a function to update that variable, and an initial state value. The state variable is persistent across renders but is mutable only through the provided setter function. The state value can be of any type (e.g., string, number, object, array).",
        "parameters": [
          {
            "parameter": "initialState",
            "explanation": "The initial value of the state variable. It can be any data type, including primitive values (strings, numbers, booleans) or reference types (objects, arrays, functions)."
          }
        ],
        "returns": [
          {
            "parameter": "state",
            "explanation": "The current state value. This value is persistent across renders and can be used for things like UI interactions, conditional rendering, or storing data."
          },
          {
            "parameter": "set function",
            "explanation": "This function is tied to the state variable and lets you update it. It takes in a new state value or a function that receives the previous state and returns the updated state. The update triggers a re-render of the component"
          }
        ],
        "examples": [
          {
            "image": "/images/usestate/image-1.png",
            "explanation": "Create state variable and set function"
          },
          {
            "image": "/images/usestate/image-2.png",
            "explanation": "The state variable can be of any type: a string, a number, an array, etc."
          },
          {
            "image": "/images/usestate/image-3.png",
            "explanation": "Change the state by calling the set function with a new value. In this example, the set function is called directly inside a button's onClick handler. Upon clicking the button, the state updates."
          },
          {
            "image": "/images/usestate/image-4.png",
            "explanation": "Now you can use the state variable inside your JSX and, for example, display it on the screen."
          },
          {
            "image": "/images/usestate/image-5.png",
            "explanation": "You can go a step further and create a boolean state variable for conditional rendering or a UI toggle element."
          }
        ],
        "docs": "https://react.dev/reference/react/useState",
        "completed": false
      },
      {
        "title": "useReducer",
        "path": "usereducer",
        "definition": "useRecuder is a React hook used for managing complex state logic. It is an alternative to useState when state transitions involve multiple sub-states or complex updates. It works by maintaining a state object and updating it through a reducer function, which takes the current state and an action and returns a new state.",
        "parameters": [
          {
            "parameter": "initialState",
            "explanation": "is the initial value of the state variable. It is often an object but can be of any type."
          },
          {
            "parameter": "reducer",
            "explanation": "is a pure function that takes in two arguments: the current state and an action object. It determines how the state should be updated based on the action type."
          }
        ],
        "returns": [
          {
            "parameter": "current state",
            "explanation": "is a state variable in the form of an object. It can be used for UI interactions, conditional rendering, storing fetched data, etc."
          },
          {
            "parameter": "dispatch",
            "explanation": "function used for sending actions to the reducer, triggering a state update."
          }
        ],
        "examples": [
          {
            "image": "/images/usereducer/image-1.png",
            "explanation": "Create the state object and dispatch function, and pass in the reducer and initialState"
          },
          {
            "image": "/images/usereducer/image-2.png",
            "explanation": "Define the initial state and pass it into the useReducer hook. This sets up the starting state for your component."
          },
          {
            "image": "/images/usereducer/image-3.png",
            "explanation": "Create the reducer function, which receives the current state and an action as arguments. The reducer contains all state logic and returns an updated state. In this example, a switch statement is used to define different actions and their corresponding state updates."
          },
          {
            "image": "/images/usereducer/image-4.png",
            "explanation": "Trigger a state update by calling the dispatch function with a specified action. If all state update logic is handled inside the reducer, simply dispatching the action type will apply the corresponding update."
          },
          {
            "image": "/images/usereducer/image-5.png",
            "explanation": "Display your state in JSX. Remember, in this example state returned by the reducer function is an object."
          },
          {
            "image": "/images/usereducer/image-6.png",
            "explanation": "If you want, you can even update multiple state variables simulatenously. This makes useReducer better than useState for handling complex state logic."
          }
        ],
        "docs": "https://react.dev/reference/react/useReducer",
        "completed": false
      }
    ]
  },
  {
    "id": 3,
    "category": "Context API",
    "path": "context-api",
    "items": [
      {
        "title": "createContext",
        "path": "createcontext",
        "definition": "createContext lets you create a place to store and distribute your state globally, also called a Context, that components can provide or consume.",
        "parameters": [
          {
            "parameter": "defaultValue",
            "explanation": "the default value will be returned by the context if there is no matching context provider."
          }
        ],
        "returns": [
          {
            "parameter": "Context.Provider",
            "explanation": "By wrapping your components into a context Provider and passing them in as a children prop, you allow them to use the state within the context. It needs a value prop which specifies what state the provider is supposed to broadcast."
          }
        ],
        "examples": [],
        "docs": "https://react.dev/reference/react/createContext",
        "completed": false
      },
      {
        "title": "useContext",
        "path": "usecontext",
        "definition": "useContext is a special hook with the goal of reading state from a Context.Provider. It can be called inside any component that's wrapped into a Context.Provider.",
        "parameters": [
          {
            "parameter": "SomeContext",
            "explanation": "Since there can be numerous contexts in one application, you have to pass the name of a specific context into the useContext hook."
          }
        ],
        "returns": [
          {
            "parameter": "state object",
            "explanation": "After specifying what context the useContext hook is supposed to read, it will return state specified in the Context.Provider's 'value'"
          }
        ],
        "examples": [],
        "docs": "https://react.dev/reference/react/useContext",
        "completed": false
      }
    ]
  },
  {
    "id": 4,
    "category": "Effects",
    "path": "effects",
    "items": [
      {
        "title": "useEffect",
        "path": "useeffect",
        "definition": "the useEffect hook lets you synchronise function triggers with state updates. Unlike normal functions, it can produce side effects. This is why it's usually used white fetching data from an external API.",
        "parameters": [
          {
            "parameter": "setup",
            "explanation": "Setup is the function with your effect's logic. In other words, it's the code that the useEffect hook will run every time it's triggered."
          },
          {
            "parameter": "dependency array",
            "explanation": "The dependency array specifies when the useEffect hook is supposed to run. If empty, the dependency array will run any functions inside the hook on mount. The dependency array takes in variables, which will trigger the effect upon changing."
          }
        ],
        "examples": [],
        "docs": "https://react.dev/reference/react/useEffect",
        "completed": false
      }
    ]
  },
  {
    "id": 5,
    "category": "Refs",
    "path": "refs",
    "items": [
      {
        "title": "useRef",
        "path": "useref",
        "definition": "the useRef hook lets you create and reference a state variable that doesn't change throughout renders.",
        "parameters": [
          {
            "parameter": "initialValue",
            "explanation": "The initial value of the state variable. It can be any type of value."
          }
        ],
        "returns": [
          {
            "parameter": "current",
            "explanation": "A mutable property that is initially set to the initialValue passed into the hook. It will not change during re-renders, unless you change it to something else manually."
          }
        ],
        "examples": [],
        "docs": "https://react.dev/reference/react/useRef",
        "completed": false
      }
    ]
  },
  {
    "id": 6,
    "category": "Performance",
    "path": "performance",
    "items": [
      {
        "title": "useMemo",
        "path": "usememo",
        "definition": "",
        "examples": [],
        "docs": "https://react.dev/reference/react/useMemo",
        "completed": false
      },
      {
        "title": "useCallback",
        "path": "usecallback",
        "definition": "",
        "examples": [],
        "docs": "https://react.dev/reference/react/useCallback",
        "completed": false
      },
      {
        "title": "useTransition",
        "path": "usetransition",
        "definition": "",
        "examples": [],
        "docs": "https://react.dev/reference/react/useTransition",
        "completed": false
      }
    ]
  }
]
